- Here we using code and create dataframe or dataset

In [3]:
import pandas as pd

In [ ]:
# Create a DataFrame from  dictionaries
sales = [{"account": "john", "january": 150, "february": 200, "march": 250},
         {"account": "max", "january": 200, "february": 210, "march": 215},
         {"account": "roshan", "january": 300, "february": 290, "march": 280},
         {"account": "kohli", "january": 150, "february": 180, "march": 200},
         {"account": "mike", "january": 200, "february": 220, "march": 230}]
df = pd.DataFrame(sales)

In [5]:
df

  account  january  february  march
0    john      150       200    250
1     max      200       210    215
2  roshan      300       290    280
3   kohli      150       180    200
4    mike      200       220    230

In [14]:
# here we use from_dict method to create a DataFrame
sales = { "account": ["john", "max", "roshan", "kohli", "mike"],
           "january": [150, 200, 300, 150, 200],
          "february": [200, 210, 290, 180, 220],
          "march": [250, 215, 280, 200, 230]}
df1 = pd.DataFrame.from_dict(sales)

In [15]:
df1

  account  january  february  march
0    john      150       200    250
1     max      200       210    215
2  roshan      300       290    280
3   kohli      150       180    200
4    mike      200       220    230

In [ ]:
# here  we use list and from_records method to create a DataFrame
Elecronic_items= [('laptops', 25, 22, 15, 27),
                  ('mobiles', 35, 30, 32, 40),
                 ('tablets', 10, 12, 15, 14),
                 ('smartwatches', 45, 43, 62, 48)]
lebles = ('items', 'january', 'february', 'march', 'april')
df2 = pd.DataFrame.from_records(Elecronic_items, columns=lebles)
df2

          items  january  february  march  april
0       laptops       25        22     15     27
1       mobiles       35        30     32     40
2       tablets       10        12     15     14
3  smartwatches       45        43     62     48